In [7]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline

from pydataset import data

from ipywidgets import AppLayout, Button

import warnings
warnings.filterwarnings('ignore')

from env import host, user, password

In [10]:
AppLayout(header=Button(description='Top'),
         footer=Button(description='Bottom'))

AppLayout(children=(Button(description='Top', layout=Layout(grid_area='header'), style=ButtonStyle()), Button(…

In [2]:
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [3]:
def get_url(database, username=user, hostname=host, password=password):
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    return url

In [4]:
url = get_url(database='employees')

print('hide get_url function results')

hide get_url function results

In [5]:
sql = 'SELECT * FROM employees LIMIT 200'

In [6]:
pd.read_sql(sql, url)

     emp_no  birth_date first_name     last_name gender   hire_date
0     10001  1953-09-02     Georgi       Facello      M  1986-06-26
1     10002  1964-06-02    Bezalel        Simmel      F  1985-11-21
2     10003  1959-12-03      Parto       Bamford      M  1986-08-28
3     10004  1954-05-01  Chirstian       Koblick      M  1986-12-01
4     10005  1955-01-21    Kyoichi      Maliniak      M  1989-09-12
..      ...         ...        ...           ...    ...         ...
195   10196  1954-01-27       Marc    Hellwagner      M  1994-11-16
196   10197  1963-08-06    Kasidit  Krzyzanowski      F  1993-11-22
197   10198  1953-05-28     Pranav        Furedi      M  1985-08-31
198   10199  1959-04-07   Kazuhisa         Ranta      M  1997-04-29
199   10200  1961-12-31      Vidya         Awdeh      M  1985-10-16

[200 rows x 6 columns]

## Excercises

### Load the mpg dataset. Read the documentation for it, and use the data to answer these questions:

In [15]:
mpg = data('mpg')

In [16]:
mpg.head(1)

  manufacturer model  displ  year  cyl     trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4  auto(l5)   f   18   29  p  compact

In [17]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

#### Rename columns

In [18]:
mpg.columns = ['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drive', 'city',
       'highway', 'fl', 'class']

In [19]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drive',
       'city', 'highway', 'fl', 'class'],
      dtype='object')

## Groupby Practice

- Interesting that city mileage seems to have gone down over time!

- Highway pretty much stayed the same over time.

In [91]:
mpg.groupby('year').city.mean()

year
1999    17.017094
2008    16.700855
Name: city, dtype: float64

In [92]:
mpg.groupby('year').highway.mean()

year
1999    23.427350
2008    23.452991
Name: highway, dtype: float64

## Merging and Joining Practice

### On average, which manufacturer has the best miles per gallon?

In [23]:
mpg.sort_values(by=['city', 'highway'], ascending=False)

,manufacturer,model,displ,year,cyl,trans,drive,city,highway,fl,class
222,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact
223,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact
197,toyota,corolla,1.8,2008,4,manual(m5),f,28,37,r,compact
100,honda,civic,1.6,1999,4,manual(m5),f,28,33,r,subcompact
...,...,...,...,...,...,...,...,...,...,...,...
55,dodge,dakota pickup 4wd,4.7,2008,8,auto(l5),4,9,12,e,pickup
60,dodge,durango 4wd,4.7,2008,8,auto(l5),4,9,12,e,suv
66,dodge,ram 1500 pickup 4wd,4.7,2008,8,auto(l5),4,9,12,e,pickup
70,dodge,ram 1500 pickup 4wd,4.7,2008,8,manual(m6),4,9,12,e,pickup
127,jeep,grand cherokee 4wd,4.7,2008,8,auto(l5),4,9,12,e,suv

#### Calculate average mileage and create a new column

In [24]:
mpg['average_mileage'] = (mpg.city + mpg.highway) / 2

#### Return only the top manufacturer for best average mileage

In [32]:
mpg.sort_values(by='average_mileage', ascending=False).manufacturer.values[0]

'volkswagen'

### How many different manufacturers are there?

In [38]:
mpg[['manufacturer']].nunique()

manufacturer    15
dtype: int64

In [43]:
len(mpg['manufacturer'].unique())

15

In [48]:
len(mpg.manufacturer.value_counts().index)

15

### How many different models are there?

In [49]:
mpg[['model']].nunique()

model    38
dtype: int64

In [50]:
len(mpg['model'].unique())

38

In [51]:
len(mpg.model.value_counts().index)

38

### Do automatic or manual cars have better miles per gallon?

In [73]:
# subset of manual transmission cars only

manual = mpg[mpg.trans.str.contains('manu')]

In [72]:
# mean of average mileage of manual transmission cars

avg_mileage_manual = manual.average_mileage.sort_values(ascending=False).mean()
avg_mileage_manual

22.227272727272727

In [63]:
automatic = mpg[mpg.trans.str.contains('auto')]

In [67]:
avg_mileage_auto = automatic.average_mileage.sort_values(ascending=False).mean()

In [70]:
print(f'The average mileage of manual cars is {round(avg_mileage_manual)} and the average mileage of automatic cars is {round(avg_mileage_auto)}.')

The average mileage of manual cars is 22 and the average mileage of automatic cars is 19.

#### Another way to do it...

In [80]:
(manual.city + manual.highway).sum() / (len(manual) * 2)

22.227272727272727

In [82]:
manual.average_mileage.sum() / len(manual)

22.227272727272727

In [86]:
print(f'The average mileage of automatics is better than manuals: {avg_mileage_auto > avg_mileage_manual}.')

The average mileage of automatics is better than manuals: False.

### Joining and Merging

- Copy the users and roles dataframes from the examples above. What do you think a right join would look like? An outer join? What happens if you drop the foreign keys from the dataframes and try to merge them?

In [97]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})

In [100]:
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [98]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

In [101]:
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [105]:
pd.merge(users, roles, how='outer', left_on='role_id', right_on='id').rename(columns={'name_x': 'name', 'name_y': 'role'})

   id_x   name  role_id  id_y       role
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

### Getting data from SQL databases

- Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url formatted like in the examples in this lesson.

In [106]:
def get_url(database, username=user, hostname=host, password=password):
    url = f'mysql+pymysql://{user}:{password}@{host}/{database}'
    return url

- Use your function to obtain a connection to the employees database.

In [110]:
url = get_url('employees')
sql = 'SELECT * FROM employees'

In [179]:
employees = pd.read_sql(sql, url, parse_dates='from_date')

In [180]:
employees.head()

   emp_no            title  from_date     to_date
0   10001  Senior Engineer 1986-06-26  9999-01-01
1   10002            Staff 1996-08-03  9999-01-01
2   10003  Senior Engineer 1995-12-03  9999-01-01
3   10004         Engineer 1986-12-01  1995-12-01
4   10004  Senior Engineer 1995-12-01  9999-01-01

In [181]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
emp_no       443308 non-null int64
title        443308 non-null object
from_date    443308 non-null datetime64[ns]
to_date      443308 non-null object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 13.5+ MB

In [183]:
today = pd.datetime.now().date()

In [172]:
print(today)

2020-03-05

In [191]:
employees.to_date.str.replace('9999-01-01', '2020-03-05')

AttributeError: Can only use .str accessor with string values!

In [175]:
employees['today'] = today

In [178]:
employees.head(5)

   emp_no            title  from_date    to_date       today
0   10001  Senior Engineer 1986-06-26        NaT  2020-03-05
1   10002            Staff 1996-08-03        NaT  2020-03-05
2   10003  Senior Engineer 1995-12-03        NaT  2020-03-05
3   10004         Engineer 1986-12-01 1995-12-01  2020-03-05
4   10004  Senior Engineer 1995-12-01        NaT  2020-03-05

- Read the employees and titles tables into two separate dataframes

In [146]:
url2 = get_url('titles')
sql = 'SELECT * FROM titles'

In [147]:
titles = pd.read_sql(sql, url, parse_dates='hire_date')

In [148]:
titles.head(1)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01

In [149]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
emp_no       443308 non-null int64
title        443308 non-null object
from_date    443308 non-null object
to_date      443308 non-null object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

- Join the employees and titles dataframes together.

In [130]:
emp_titles = pd.merge(employees, titles, on='emp_no', how='outer')
emp_titles.head(1)

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01

- Visualize the number of employees with each title.

In [125]:
emp_titles.groupby('title')[['emp_no']].count().sort_values(by='emp_no').rename(columns={'emp_no': 'count'})

                     count
title
Manager                 24
Assistant Engineer   15128
Technique Leader     15159
Senior Staff         92853
Senior Engineer      97750
Staff               107391
Engineer            115003

### Visualize how frequently employees change titles.

#### Number of employees who have held 1, 2, or 3 titles in their time at the company.

In [128]:
emp_titles.groupby('emp_no').title.count().value_counts()

1    159754
2    137256
3      3014
Name: title, dtype: int64

In [129]:
emp_titles.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 443308 entries, 0 to 443307
Data columns (total 9 columns):
emp_no        443308 non-null int64
birth_date    443308 non-null object
first_name    443308 non-null object
last_name     443308 non-null object
gender        443308 non-null object
hire_date     443308 non-null object
title         443308 non-null object
from_date     443308 non-null object
to_date       443308 non-null object
dtypes: int64(1), object(8)
memory usage: 33.8+ MB